bin/config-install
#!/usr/bin/env -S emacs -Q --script # -*- mode: emacs-lisp; lexical-binding: t; -*-
;; [[file:../config-cli.org::*Install][Install:1]]
(require 'org)
(require 'org-element)
(require 'ob-core)
(require 'ob-shell)

(defvar config-root (replace-regexp-in-string "bin/[^/]+$" "" load-file-name))
(setq org-confirm-babel-evaluate nil)
(dolist (file (directory-files-recursively config-root ".org$"))
  (with-temp-buffer
    (insert-file-contents file)
    (delay-mode-hooks (org-mode))
    (if (string-match-p "/install\\.org$" file)
        ;; execute the whole file if it's basename
        (org-babel-execute-buffer)
      ;; Search for subtrees called 'install'
      (org-map-entries
       (lambda ()
         (when (org-entry-properties (point) "config-install")
           (org-babel-execute-subtree)))))))
;; Install:1 ends here
