bin/config-update
#!/usr/bin/env -S emacs -Q --script # -*- mode: emacs-lisp; lexical-binding: t; -*-
;; [[file:~/Projects/dotfiles/config-cli.org::*Update][Update:1]]
(defvar config-root (replace-regexp-in-string "bin/[^/]+$" "" load-file-name))

(require 'notifications)
(let* ((default-directory config-root)
       (clean? (equal "\n" (shell-command-to-string "git status -u --porcelain=v2 | awk '{print $(NF)}'"))))
       (if clean?
             (shell-command-to-string "git pull && config-tangle")
           (notifications-notify
            :title "Skipping update"
            :body "Config not clean"
            :timeout 1500)))
;; Update:1 ends here
